In [1]:
# Programmer : Shreyash Dhomkar
# College : Keystone SOE
# Class : TE
# Roll No : 57

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('student.csv')

In [4]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

## Slicing- Index Based

In [5]:
x = df.iloc[4:9,1:3]
print(x)

     name class
4    asha    TE
5  ayesha    BE
6    amar    BE
7   amita    BE
8    amol    TE

In [6]:
df.iloc[:9,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [7]:
df.iloc[4:9,1:]

     name class  marks  age
4    asha    TE  63.28   20
5  ayesha    BE  49.55   20
6    amar    BE  65.34   19
7   amita    BE  68.33   23
8    amol    TE  56.75   20

In [8]:
df.iloc[:,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [9]:
df.iloc[:,:]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [10]:
type(x)

pandas.core.frame.DataFrame

In [11]:
df.iloc[[5,7,3,1],:]

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
7     8    amita    BE  68.33   23
3     4  ajinkya    TE  69.66   20
1     2     amit    TE  59.77   21

In [12]:
df.iloc[[5,7,3,1],[1,3]]

      name  marks
5   ayesha  49.55
7    amita  68.33
3  ajinkya  69.66
1     amit  59.77

In [13]:
df.iloc[5,:]

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

In [14]:
df.iloc[5]

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

## Row Numbers are Complusory, not column numbers

In [15]:
df.iloc[:,3]

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [16]:
df.iloc[3,4]

20

In [17]:
df.iloc[3,1]

'ajinkya'

In [18]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [19]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [20]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [21]:
df[['name','marks','age']]

      name  marks  age
0     anil  56.77   22
1     amit  59.77   21
2   aniket  76.88   19
3  ajinkya  69.66   20
4     asha  63.28   20
5   ayesha  49.55   20
6     amar  65.34   19
7    amita  68.33   23
8     amol  56.75   20
9    anmol  78.66   21

In [22]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [23]:
df.marks

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [24]:
df.iloc[list(range(5))+list(range(6,10))]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

## Excluded row 5

In [25]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [26]:
list(range(5)) + list(range(6,10))

[0, 1, 2, 3, 4, 6, 7, 8, 9]

In [27]:
df.drop([5,2,8])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [28]:
df.drop('name', axis=1)

   roll class  marks  age
0     1    TE  56.77   22
1     2    TE  59.77   21
2     3    BE  76.88   19
3     4    TE  69.66   20
4     5    TE  63.28   20
5     6    BE  49.55   20
6     7    BE  65.34   19
7     8    BE  68.33   23
8     9    TE  56.75   20
9    10    BE  78.66   21

In [29]:
df.drop(['name','age'], axis=1)

   roll class  marks
0     1    TE  56.77
1     2    TE  59.77
2     3    BE  76.88
3     4    TE  69.66
4     5    TE  63.28
5     6    BE  49.55
6     7    BE  65.34
7     8    BE  68.33
8     9    TE  56.75
9    10    BE  78.66

## Functions/Methods

In [30]:
df['marks'].mean()

64.499

In [31]:
df['marks'].min()

49.55

In [32]:
df['marks'].max()

78.66

In [33]:
df['marks'].sum()

644.9899999999999

In [34]:
df['name'].max()

'ayesha'

In [35]:
df['name'].min()

'ajinkya'

In [36]:
df['name'].sum()

'anilamitaniketajinkyaashaayeshaamaramitaamolanmol'

In [37]:
df['marks'].median()

64.31

In [38]:
df['marks'].std()

9.207178901994535

In [39]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [40]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [41]:
df['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [42]:
df['age'].mode()

0    20
Name: age, dtype: int64

In [43]:
df['name'].count()

10

In [44]:
df.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [45]:
df.std(numeric_only=True)

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [46]:
df.mean(numeric_only=True, axis=1)

0    26.590000
1    27.590000
2    32.960000
3    31.220000
4    29.426667
5    25.183333
6    30.446667
7    33.110000
8    28.583333
9    36.553333
dtype: float64

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes